## 💻 과제 개요

#2557번, Hello World : Hello World! 출력하기 
print("Hello World!")

#1000번, A+B : 변수 A+B 출력하기
A,B = map(int, input().split())
print(A+B)

#1001번, A-B : 변수 A-B 출력하기
A,B = map(int, input().split())
print(A-B)

#10998번, AXB : 변수 A*B 출력하기
A,B = map(int, input().split())
print(A*B)

#1008번, A/B : 변수 A/B 출력하기 (floating number)
A,B = map(int, input().split())
print(A/B)

#10869번, 사칙연산 : 사칙연산 출력력하기
A,B = map(int, input().split())
print(A+B)
print(A-B)
print(A*B)
print(A//B)
print(A%B)

#10926번, ??! : ??! 붙여서 출력하기
x = input()
print(x + '??!')

#18108번, 1998년생인 내가 태국에서는 2541년생?! : 연도 바꿔 출력하기 (계산)

y = int(input())
x = y - 543
print(x)

#10430번, 나머지 : 3가지 변수로 계산하기 (나머지)

A, B, C = map(int, input().split())
print((A+B)%C)
print(((A%C)+(B%C))%C)
print((A*B)%C)
print(((A%C)*(B%C))%C)

#2588번, 곱셉 : 곱셈 단계별로하기

A = int(input())
B = input()
print(A*int(B[2]))
print(A*int(B[1]))
print(A*int(B[0]))
print(A*int(B))

#11382번, 꼬마 정민 : 3가지 변수 더하기기

A, B, C = map(int, input().split())
print(A+B+C)

#10171번, 고양이 : 고양이 출력하기 

print("\\    /\\")
print(" )  ( ')")
print("(  /  )")
print (" \\(__)|")

#10172번, 개 : 강아지 출력하기

print ("|\\_/|")
print("|q p|   /}")
print('( 0 )"""\\')
print('|"^"`    |')
print("||_/=\\\\__|")


## ✅ 새롭게 배운 점
#한 줄에 여러 변수가 입력될 때 어떻게 해야 오류가 안 나는지를 배웠고, 이를 활용할 수 있었다.

## 💡 느낀 점
#백준을 통해 여러가지 코드를 입력해보고 답을 도출하는 것이 실력을 키우는 데에 유익했던 거 같다.
#다만 아직 vs code에서 커밋하여 깃허브에 올리는 과정이 익숙치 않아 시간이 걸렸던 거 같다. 
